import 'package:flutter/material.dart';

class PrivacyView extends StatelessWidget {
  const PrivacyView({super.key});

  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        title: Text("شروط الاستخدام وسياسة الخصوصية"),
      ),
      body: SingleChildScrollView(
        child: Padding(
          padding: const EdgeInsets.all(8.0).copyWith(bottom: 100),
          child: Column(
            children: [
              Text(
                '''سياسة الاستخدام :

1- أستخدم التطبيق يحتاج إلى الاتصال بالانترنت طيلة فترة العمل على التطبيق

2- عند تفعيل أي كود سيبقى فعالاً على جهازك لمدة عام دراسي كامل

3- مع بداية عام دراسي جديد يتم إلغاء الاشتراكات جميعها

4- لاحقاً سيتم إصدار تحديثات للتطبيق مع العلم هذه التحديثات ستكون مجانية ولا يترتب عليها أي تكلفة

5- يتم تفعيل الكود على جهاز واحد ولا يمكن استخدام الكود على جهاز آخر

6-استخدام التطبيق على جوالين بنفس الحساب ونفس الكود يعرض الحساب للحظر مباشرة

7- عليك الاحتفاظ بالأكواد الخاصة بك ليتم ضمان حقوقك طيلة فترة الاستخدام المستحق

حقوق المستخدم ومسؤولياته وآليات الخصوصية والحماية لمعلوماته :

1- إن تطبيق مؤتمت لا يقوم بنشر أو مشاركة أو معالجة أي معلومات شخصية وكافة البيانات التي يقوم التطبيق بتبادلها عبر الإنترنت تتم عبر قنوات آمنة

2- التطبيق لا يطلب ولا يحتاج للموافقة على أي سماحيات استثنائية من قبل المستخدم

عند تفعيل تطبيق مؤتمت فإن المستخدم يحصل على ترخيص شخصي ومحدود وغير حصري وغير قابل للتحويل و قابل للنقض للقيام بما يلي :

1- تحميل التطبيق والدخول إليه و استخدامه بما في ذلك أي تحديثات تتم عليه وذلك على جهاز هاتف نقال واحد

2- الدخول إلى المحتوى المفعّل واستخدامه فقط على جهاز هاتف واحد ( موبايل )

وفقاً للشروط والأحكام المحددة وفق سياسة الاستخدام

لا يحق للمستحدم ما يلي :

1- استخدام الميزات الممنوحة له تجارياً أو توزيعها أو مشاركتها مع أي طرف ثالث دون الحصول على موافقة خطية مسبقة من الجهة المالكة للتطبيق

2- نسخ أو توزيع أو إعادة إنتاج أو تأجير أو إعارة أو إقراض أو إعادة ترخيص أي جزء من أجزاء التطبيق أو المحتوى أو كلاهما

3- ترجمة أو تكييف أو تعديل أو تغيير او الجمع بين التطبيق او المحتوى أو أي جزء منها مع تطبيقات أو برامج أو موارد أخرى أو إعداد أنشطة مشتقة كلياً أو جزئياً من التطبيق أو المحتوى أو كلاهما

4- جعل التطبيق متاحاً على شبكات أو مواقع غير متوافقة مع القوانين والأنظمة

5- إعادة تصميم أو تفريغ أو تفكيك أو استخلاص المحتوى أو غير ذلك من الأنشطة التي تحد من عمل التطبيق أو أي من مكوناته الفرعية

6- الاستخدام أو الاستفادة من التطبيق، أو أي جزء منه، لأية أغراض تجاريّة، بما في ذلك أي عمليات مبيعات، أو إعلانات، أو أنشطة تسويق، أو رعاية، أو أي حملات ترويجيّة تجاريّة أُخرى، أو جميعهم دون الحصول على موافقة خطيّة وصريحة حول ذلك من الجهة المالكة للتطبيق.

7- الإخلال بحقوق الملكيّة الفكريّة للتطبيق وكافة مكوناته.

8- استخدام التطبيق لغير الغاية المُعد من أجلِها.

حقوق الجهة المسؤولة عن التطبيق وواجباتها:

1- هذا التطبيق ومحتواه محمي من النشر والنسخ من قبل أي شخص تحت طائلة المُساءلة القانونيّة بموجب أحكام قانون حماية حقوق المؤلف والحقوق المجاورة الصادر بالمرسوم التشريعي رقم (٦٢) لعام ٢٠١٣م

2- تحتفظ الجهة المالكة للتطبيق أو الأطراف التي ترخصها أو كلاهما وموردوها بحقوق الطبع والنشر الخاصة بالتطبيق والمحتوى. وبموجب هذه الاتفاقيّة فإن المستخدم يوافق ويؤكد على أن التطبيق والمحتوى يشتملان على مواد محفوظة بقوانين حقوق الملكيّة وحقوق النشر، وأن تصميم وهيكل التطبيق فضلاً عن كل عنصر من العناصر التي تم تجميعها ضمن المحتوى يحتوي على قيمة تجارية ومواد محميّة بقوانين حقوق الطبع والنشر وغيرهم من حقوق الملكيّة الفكريّة المملوكة حصرياً للجهة المالكة.

3- تقدم الجهة المالكة للتطبيق، (وشركائها الذين ترخصهم ووكلائها وأعضاء مكتبها ومدراءها وموظفوها والتابعون لها وأصحاب الحقوق فيها والشركات التابعة لها وأعضائها) التطبيق والمحتوى كما هو دون أي ضمان من أي نوع، وتعلن بالنيابة عن نفسها والشركات التي ترخصها وكل عضو مذكور هُنا، بشكل صريح عدم مسؤوليتها عن تقديم أي ضمانات صريحة أو ضمنيّة للعناوين وصلاحية العرض في السوق وملائمته لغرض مُعيَّن ومستوى الجودة المناسب. كما لا تضمن أن تلبي الوظائف الواردة في التطبيق متطلبات المستخدم، ولا تضمن ألّا يكون تشغيل التطبيق متقطعاً أو خالياً من الأخطاء، ولا تضمن أن يتم تصحيح العيوب الموجودة في التطبيق، أو أن الوظائف الواردة في التطبيق ستعمل مع برامج أو أجهزة أخرى أو ضمن نظام مُعيَّن. ولا تُعتبر أي معلومات شفويّة أو خطيّة أو نصيحة قدمتها الجهة المالكة أو أعضائها أو ممثلها الرسمي على أنها أي شكل من أشكال الضمانات.

4- إدارة التطبيق غير مسؤولة عن توقف بعض خدمات التطبيق عن العمل بسبب ظروف قاهرة وخارجة عن إرادتها على سبيل المثال لا الحصر انقطاع الانترنت عن البلاد بشكل كُلي

5- قد تقوم الجهة المالكة للتطبيق، وفقاً لتقديرها الخاص، بتطوير وتقديم أو عرض تحديثات أو ملاحق أو مكونات إضافيّة أو خدمات دعم للمنتج أو مكونات لخدمات تستند على الإنترنت على التطبيق من وقت لآخر.

الإجراءات التي ستتخذُها الجهة في حال مخالفة المستخدم لسياسة الاستخدام:

- إن أي استخدام للتطبيق بشكل يتعارض مع شروط وقواعد الاستخدام المسموح بها ووفق الأنظمة والقوانين السارية في الجمهوريّة العربيّة السوريّة تحمّل المستخدم المسؤوليّة الكاملة عن تلك الأفعال ولا تتحمل الجهة صاحبة التطبيق أو المطورة له أي مسؤوليّة قانونيّة جرّاء ذلك.

تعديل سياسة الاستخدام:

باستثناء الحد الذي تقتضيه القوانين المعمول بها، نحتفظ بحق تحديث سياسة الاستخدام لتعكس التغيُّرات التي تطرأ على التطبيق والخدمات التي يُقدمها''',
                style: TextStyle(
                  color: Colors.black,
                ),
              ),
            ],
          ),
        ),
      ),
    );
  }
}
